Show / Hide Table of Contents
Class PretensionedTendonGroup
The Pretensioned tendon group
Inheritance
System.Object
OpenObject
OpenElementId
Tendon
PretensionedTendonGroup
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.PretensionedTendonGroup,CI.StructuralElements", "CI.StructModel.Structure.IPretensionedTendonGroup,CI.BasicTypes", typeof(Tendon))]
public class PretensionedTendonGroup : Tendon
Constructors
Improve this Doc   View Source
PretensionedTendonGroup()
Constructor
Declaration
public PretensionedTendonGroup()
Properties
Improve this Doc   View Source
Items
List of the pretensioned tendon in the group
Declaration
public List<PretensionedTendonGroupItem> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PretensionedTendonGroupItem>
 Improve this Doc
 View Source